 // 내신 성적 초기 데이터
 var gradeInit = {
    main_1 : [{
            // 교과학습 
        step0 : {step :0, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step1 : {step :1,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step2 : {step :2, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step3 : {step :3, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step4 : {step :4, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step5 : {step :5, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step6 : {step :6,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step7 : {step :7,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step8 : {step :8,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step9 : {step :9,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step10 : {step :10,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step11 : {step :11,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step12: {step :12,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step13 : {step :13,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step14 : {step :14,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step15 : {step :15,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step16 : {step :16,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step17 : {step :17,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step18 : {step :18,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step19 : {step :19,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
       
    },
    
    {
        // 예체능
        step0 : {step :0, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step1 : {step :1,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step2 : {step :2, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step3 : {step :3, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step4 : {step :4, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step5 : {step :5, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step6 : {step :6,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step7 : {step :7,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step8 : {step :8,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
        step9 : {step :9,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
   
 
    }], 

    main_2 : [{
        // 교과학습 
    step0 : {step :0, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step1 : {step :1,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step2 : {step :2, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step3 : {step :3, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step4 : {step :4, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step5 : {step :5, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step6 : {step :6,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step7 : {step :7,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step8 : {step :8,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step9 : {step :9,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step10 : {step :10,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step11 : {step :11,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step12: {step :12,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step13 : {step :13,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step14 : {step :14,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step15 : {step :15,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step16 : {step :16,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step17 : {step :17,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step18 : {step :18,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step19 : {step :19,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
   
},
{
    // 진로선택항목 
    step0 : {step :0, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 성취도_A : 0, 성취도_B : 0, 성취도_C : 0, 석차등급 : 0, 비고 : ''},
    step1 : {step :1,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 성취도_A : 0, 성취도_B : 0, 성취도_C : 0, 석차등급 : 0, 비고 : ''},
    step2 : {step :2, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 성취도_A : 0, 성취도_B : 0, 성취도_C : 0, 석차등급 : 0, 비고 : ''},
    step3 : {step :3, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 성취도_A : 0, 성취도_B : 0, 성취도_C : 0, 석차등급 : 0, 비고 : ''},
    step4 : {step :4, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 성취도_A : 0, 성취도_B : 0, 성취도_C : 0, 석차등급 : 0, 비고 : ''},
    step5 : {step :5, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 성취도_A : 0, 성취도_B : 0, 성취도_C : 0, 석차등급 : 0, 비고 : ''},
    step6 : {step :6,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 성취도_A : 0, 성취도_B : 0, 성취도_C : 0, 석차등급 : 0, 비고 : ''},
    step7 : {step :7,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 성취도_A : 0, 성취도_B : 0, 성취도_C : 0, 석차등급 : 0, 비고 : ''},
    step8 : {step :8,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 성취도_A : 0, 성취도_B : 0, 성취도_C : 0, 석차등급 : 0, 비고 : ''},
    step9 : {step :9,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 성취도_A : 0, 성취도_B : 0, 성취도_C : 0, 석차등급 : 0, 비고 : ''},


},
{
    // 예체능
    step0 : {step :0, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step1 : {step :1,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step2 : {step :2, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step3 : {step :3, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step4 : {step :4, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step5 : {step :5, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step6 : {step :6,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step7 : {step :7,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step8 : {step :8,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
    step9 : {step :9,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},


}], 
main_3 : [{
    // 교과학습 
step0 : {step :0, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step1 : {step :1,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step2 : {step :2, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step3 : {step :3, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step4 : {step :4, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step5 : {step :5, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step6 : {step :6,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step7 : {step :7,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step8 : {step :8,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step9 : {step :9,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step10 : {step :10,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step11 : {step :11,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step12: {step :12,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step13 : {step :13,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step14 : {step :14,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step15 : {step :15,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step16 : {step :16,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step17 : {step :17,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step18 : {step :18,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step19 : {step :19,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},

},
{
// 진로선택항목 
step0 : {step :0, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step1 : {step :1,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step2 : {step :2, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step3 : {step :3, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step4 : {step :4, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step5 : {step :5, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step6 : {step :6,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step7 : {step :7,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step8 : {step :8,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step9 : {step :9,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},


},
{
// 예체능
step0 : {step :0, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step1 : {step :1,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step2 : {step :2, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step3 : {step :3, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step4 : {step :4, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step5 : {step :5, 학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step6 : {step :6,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step7 : {step :7,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step8 : {step :8,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},
step9 : {step :9,학기 : 0, 교과 : '', 과목 : '', 단위수 : 0, 원점수 : 0, 과목평균 : 0, 표준편차 : 0, 성취도 : '', 수강자수 : 0, 석차등급 : 0, 비고 : ''},


}], 

    이수단위합계 : {
      grade_1 : '',
      grade_2 : '',
      grade_3 : '',

    },
    특기사항 : {
      grade_1 : '',
      grade_2 : '',
      grade_3 : '',

    },

    출결상황 : 
      { step0 : {
        step : 0,
        학년 : 1,
        수업일수 : 0,
        결석_질병 : 0,
        결석_미인정 : 0,
        결석_기타 : 0,

        지각_질병 : 0,
        지각_미인정 : 0,
        지각_기타 : 0,

        조퇴_질병 : 0,
        조퇴_미인정 : 0,
        조퇴_기타 : 0,

        결과_질병 : 0,
        결과_미인정 : 0,
        결과_기타 : 0,
        특기사항 : ''}, 
        step1 : {
          step : 1,
          학년 : 2,
          수업일수 : 0,
          결석_질병 : 0,
          결석_미인정 : 0,
          결석_기타 : 0,
  
          지각_질병 : 0,
          지각_미인정 : 0,
          지각_기타 : 0,
  
          조퇴_질병 : 0,
          조퇴_미인정 : 0,
          조퇴_기타 : 0,
  
          결과_질병 : 0,
          결과_미인정 : 0,
          결과_기타 : 0,
          특기사항 : ''}, 
          step2 : {
            step : 2,
            학년 : 3,
            수업일수 : 0,
            결석_질병 : 0,
            결석_미인정 : 0,
            결석_기타 : 0,
    
            지각_질병 : 0,
            지각_미인정 : 0,
            지각_기타 : 0,
    
            조퇴_질병 : 0,
            조퇴_미인정 : 0,
            조퇴_기타 : 0,
    
            결과_질병 : 0,
            결과_미인정 : 0,
            결과_기타 : 0,
            특기사항 : ''} 
     
      },
   
    창의적체험활동 : {
      step0 : {step :0, 학년 : 1, 영역 : '', 시간 : 0, 특기사항 : ''},
      step1 : {step :1, 학년 : 1, 영역 : '', 시간 : 0, 특기사항 : ''},
      step2 : {step :2, 학년 : 1, 영역 : '', 시간 : 0, 특기사항 : ''},
      step3 : {step :3, 학년 : 2, 영역 : '', 시간 : 0, 특기사항 : ''},
      step4 : {step :4, 학년 : 2, 영역 : '', 시간 : 0, 특기사항 : ''},
      step5 : {step :5, 학년 : 2, 영역 : '', 시간 : 0, 특기사항 : ''},
      step6 : {step :6, 학년 : 3, 영역 : '', 시간 : 0, 특기사항 : ''},
      step7 : {step :7, 학년 : 3, 영역 : '', 시간 : 0, 특기사항 : ''},
      step8 : {step :8, 학년 : 3, 영역 : '', 시간 : 0, 특기사항 : ''},
      
      
    },
    봉사활동실적 : {

      step0 : {step :0,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step1 : {step :1,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step2 : {step :2,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step3 : {step :3,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step4 : {step :4,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step5 : {step :5,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step6 : {step :6,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step7 : {step :7,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step8 : {step :8,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step9 : {step :9,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step10 : {step :10,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step11 : {step :11,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step12 : {step :12,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step13 : {step :13,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step14 : {step :14,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step15 : {step :15,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step16 : {step :16,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step17 : {step :17,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step18 : {step :18,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step19 : {step :19,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step20 : {step :20,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step21 : {step :21,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step22 : {step :22,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step23 : {step :23,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step24 : {step :24,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step25 : {step :25,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step26 : {step :26,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step27 : {step :27,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step28 : {step :28,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step29 : {step :29,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step30 : {step :30,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step31 : {step :31,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step32 : {step :32,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step33 : {step :33,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step34 : {step :34,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step35 : {step :35,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step36 : {step :36,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step37 : {step :37,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step38 : {step :38,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },
      step39 : {step :39,봉사기간 : '', 주관기관 : '', 내용 : '', 시간 : 0, 누계시간 : 0 },

    },
    세부능력및특기사항 : {
        grade_1 : '',
        grade_2 : '',
        grade_3 : '', 
    },
    독서활동 : {
      step0 : {step :0, 과목 : '', 독서활동: '' },
      step1 : {step :1, 과목 : '', 독서활동: '' },
      step2 : {step :2, 과목 : '', 독서활동: '' },
      step3 : {step :3, 과목 : '', 독서활동: '' },
      step4 : {step :4, 과목 : '', 독서활동: '' },
      step5 : {step :5, 과목 : '', 독서활동: '' },
      step6 : {step :6, 과목 : '', 독서활동: '' },
      step7 : {step :7, 과목 : '', 독서활동: '' },
      step8 : {step :8, 과목 : '', 독서활동: '' },
      step9 : {step :9, 과목 : '', 독서활동: '' },
    },
    행동특성 : {
      step0 : {step :0, 학년 : 1, 내용: '' },
      step1 : {step :1, 학년 : 2, 내용: '' },
      step2 : {step :2, 학년 : 3, 내용: '' },
    },
  }

  export {
    gradeInit,
  }