import styled from 'styled-components';

const Container = styled.div`
    width: 100%;
    height: 100%;
    background: #f4f4f4;
    border-radius: 12px;
    padding: 15px;
    margin-top: 50px;
    @media (max-width: 420px) {
        margin-top: -54px;
    }
`;

const BoldText = styled.div`
    font-weight: bold;
    font-size: 20px;
    line-height: 28px;
    margin-bottom: 12px;
`;

const LightText = styled.pre`
    font-size: 14px;
    line-height: 20px;
    color: #656565;
    white-space: pre-wrap;
`;

const Privacy = () => {
    return (
        <Container>
            <LightText>
                {`거북닷컴은 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 개인정보보호법, 통신비밀보호법, 전기통신사업법, 등 정보통신서비스제공자가 준수하여야 할 관련 법령상의 개인정보보호 규정을 준수하며, 관련 법령에 의거한 개인정보처리방침을 정하여 이용자 권익 보호에 최선을 다하고 있습니다.
 
[목차]
1.수집하는 개인정보 항목 및 수집방법
2.개인정보의 수집 및 이용 목적
3.수집한 개인정보의 보유 및 이용기간
4.개인정보의 파기절차 및 방법
5.개인정보의 제공
6.개인정보 자동 수집 장치의 설치ㆍ운영 및 거부에 관한 사항
7.개인정보보호를 위한 기술적/관리적 대책
8.이용자 및 법정대리인의 권리와 그 행사방법
9.개인정보보호책임자/담당자 및 상담ㆍ신고
10.부칙
 
 
1. 수집하는 개인정보 항목 및 수집방법

①개인정보 수집항목
*회사는 회원가입, 원활한 고객상담, 각종 서비스의 제공을 위해 최초 회원가입 당시 아래와 같은 개인정보를 수집하고 있습니다.
<필수 수집항목> 이름, 로그인ID, 비밀번호, 생년월일, 회원구분, 학교/학원, 계열, 학년, 반, 번호, 휴대폰번호, 이메일
목적 : 회원관리
<선택 수집항목> 소속학교/학원, 계열, 학년, 반, 번호(단체회원), 주소, THE PREMIUM 인증코드
목적 : 회원관리, 성적조회 및 상품 배송
*유료 서비스 이용 과정에서 아래와 같은 결제 정보들이 수집될 수 있습니다.
신용카드 결제 시 : 카드사명, 카드번호 등
휴대전화 결제 시 : 은행명, 계좌번호 등
계좌이체 시 : 은행명, 입금자명 등
무통장 입금시 : 은행명, 가상계좌번호, 입금자명, 거래번호
*서비스 이용 과정에서 아래와 같은 정보들이 자동으로 생성되어 수집 될 수 있습니다.
IP Address, 쿠키, 방문 일시, 서비스 이용 기록, 불량 이용 기록

②개인정보 수집방법
회사는 다음과 같은 방법으로 개인정보를 수집합니다.
 
홈페이지, 어플리케이션, 서면양식, 팩스, 전화, 게시판, 이메일, 이벤트 응모, 배송요청, 서비스이용
협력회사로부터의 제공
고객센터의 전화를 통한 개인정보 수집

2. 개인정보의 수집 및 이용 목적
회사는 수집한 개인정보를 다음의 목적을 위해 활용합니다. 이용자가 제공한 모든 정보는 하기 목적에 필요한 용도 이외로는 사용되지 않으며 이용 목적이 변경될 시에는 사전동의를 구할 것입니다.
 
①서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금정산
콘텐츠제공, 구매 및 요금 결제, 물품배송 또는 청구지등 발송, 요금추심
 
 
②회원관리
금융거래 본인 인증 및 금융 서비스, 서비스 이용에 따른 본인확인, 개인 식별, 불량회원의 부정 이용 방지와 비인가 사용 방지, 가입 의사 확인, 연령확인, 불만처리 등 민원처리, 고지사항 전달
 
 
③마케팅 및 광고에 활용
신규 서비스(제품) 개발 및 특화, 이벤트 등 광고성 정보 전달, 인구통계학적 특성에 따른 서비스제공 및 광고 게재, 접속 빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 위함
 
 
※ ①,②,③의 목적을 위해 수집되는 필수항목 및 선택항목 수집의 동의 거부 시 입학 및 수업에 대한 불이익은 없으나, 학원에서 제공하는 서비스 중 해당 정보가 필요한 일부 서비스는 제한 될 수 있습니다.
 
3. 수집한 개인정보의 보유 및 이용 기간
회사는 회원가입일로부터 서비스를 제공하는 기간 동안에 한하여 이용자의 개인정보를 보유 및 이용하게 됩니다. 회원 탈퇴를 요청하거나 개인정보의 수집 및 이용에 대한 동의를 철회하는 경우, 수집 및 이용목적이 달성되거나 보유 및 이용기간이 종료한 경우 해당 개인정보를 지체 없이 파기합니다. 단, 다음과 같은 경우 일정기간 회원정보를 보관하며 보관된 개인정보는 보관 목적으로만 이용합니다.
 
①회사의 내부 방침에 의한 정보 보유
*보존 항목: 이름, 생년월일, 성별, 로그인ID, 자택 주소, 휴대전화번호
*보존 근거: 불량 이용자의 재가입 방지, 명예훼손 등 권리침해 분쟁 및 수사협조
*보존 기간: 1년

②관계 법령의 규정에 따른 정보 보유
*서비스 이용 관련 개인정보(서비스 이용기록, 접속로그, 접속 IP 정보)
- 보존 근거 : 통신비밀보호법
- 보존 기간: 3개월
*계약 또는 청약철회 등에 관한 기록
- 보존 근거 : 전자상거래 등에서의 소비자보호에 관한 법률
- 보존 기간: 5년
*대금결제 및 재화 등의 공급에 관한 기록
- 보존 근거 : 전자상거래 등에서의 소비자보호에 관한 법률
- 보존 기간 : 5년
*소비자의 불만 또는 분쟁처리에 관한 기록
- 보존 근거 : 전자상거래 등에서의 소비자보호에 관한 법률
- 보존 기간 : 3년
*본인확인에 관한 기록
- 보존 근거 : 정보통신망 이용촉진 및 정보보호 등에 관한 법률
- 보존 기간 : 6개월
*거래에 관한 장부 및 증거서류
- 보존 근거 : 국세기본법
- 보존 기간 : 5년

4. 개인정보의 파기절차 및 방법
회사의 개인정보 파기절차 및 방법은 다음과 같습니다.
 
①파기절차
이용자가 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 별도의 DB로 옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(보유 및 이용기간 참조) 일정 기간 저장된 후 파기됩니다. 개인정보는 법률에 의한 경우가 아니고서는 보유 이외의 다른 목적으로 이용되지 않습니다.

②파기방법
종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기하고 전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.

③개인정보 유효기간제
정보통신망 이용촉진 및 정보보호 등에 관한 법률 및 동법 시행령에 따라 1년간 서비스를 이용하지 않은 회원의 개인정보를 보호하기 위해 개인정보 파기 또는 분리보관 등 필요한 조치를 취합니다. 또한, 회사는 객관적으로 계정정보 도용 피해가 우려되는 경우 또는 회원이 계속해서 3년 이상 로그인하지 않을 경우에는 회원정보의 보호 및 운영의 효율성을 위해 임시조치, 이용제한, 계정정보 삭제 등 필요한 조치를 취할 수 있습니다. 본 항에 따른 조치가 취해지는 경우, 회사는 조치일 30일 전까지 개인정보 파기 등 필요한 조치가 취해진다는 사실, 일시 및 항목을 명시하여 이용약관 제8조에 따라 통지합니다.
 
5. 개인정보의 제공
회사는 이용자의 개인정보를 본 방침 제2조(개인정보의 수집 및 이용 목적)에서 명시한 범위 내에서만 처리하며, 동 범위를 초과하여 개인정보를 이용하거나 제3자에게 제공하지 않습니다. 
 
6. 개인정보 자동 수집 장치의 설치ㆍ운영 및 거부에 관한 사항
회사는 회원님들에게 보다 나은 서비스를 제공하기 위해, 개인정보를 저장하고 수시로 찾아낼 수 있도록 일부 기능을 위한 '쿠키'를 사용하고 있습니다. 단, 보안상의 취약점으로 중요 개인정보는 '쿠키'를 사용하지 않습니다.
 
①쿠키의 사용 목적
회원과 비회원의 접속 빈도나 방문 시간 등을 분석, 이용자의 성향과 관심분야를 파악 및 자취 추적, 각종 이벤트 참여 정도 및 방문 회수 파악 등을 통한 차별화된 마케팅 및 개인 특화 서비스 제공의 목적으로 쿠키를 사용합니다.
 
 
②쿠키 설정 거부 방법
귀하는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서 귀하는 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도 있습니다.
■ 설정방법(인터넷 브라우저) 도구 → 인터넷 옵션 → 개인정보에서 설정을 변경하실 수 있습니다.
 
7. 개인정보보호를 위한 기술적/관리적 대책
회사는 이용자의 개인정보를 처리함에 있어 개인정보가 분실, 도난, 유출, 변조 또는 훼손되지 않도록 안정성 확보를 위하여 다음과 같은 기술적, 관리적 대책을 강구하고 있습니다.
 
①개인정보 암호화
이용자의 개인정보는 비밀번호에 의해 보호되며, 중요한 데이터는 파일 및 전송 데이터를 암호화하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 통해 보호 하고 있습니다.
 
 
②해킹 등에 대비한 기술적 대책
회사는 해킹이나 컴퓨터 바이러스 등에 의해 이용자의 개인정보가 유출되거나 훼손되는 것을 막기 위해 외부로부터 접근이 통제된 구역에 시스템을 설치하고, 침입 차단장치 이용 및 침입탐지시스템을 설치하여 24시간 감시하고 있습니다. 그리고 백신 프로그램을 주기적으로 업데이트하며 갑작스런 바이러스가 출현할 경우 백신이 나오는 즉시 이를 적용함으로써 개인정보가 침해되는 것을 방지하고 있습니다.
 
 
③개인정보처리시스템 접근 제한
회사는 개인정보처리자에 대한 접근권한의 부여, 변경, 말소 등에 관한 기준을 수립하고 비밀번호의 생성 방법, 변경 주기 등을 규정 운영하며 기타 개인정보에 대한 접근통제를 위해 필요한 조치를 다하고 있습니다.
 
 
④개인정보 처리 직원의 교육
개인정보관련 처리 직원은 담당자에 한정시켜 최소화 하고 새로운 보안기술의 습득 및 개인정보보호 의무에 관해 정기적인 교육을 실시하며 별도의 비밀번호를 부여하여 접근 권한을 관리하는 등 관리적 대책을 시행하고 있습니다.
 
 
⑤개인 아이디와 비밀번호 관리
이용자가 사용하는 ID와 비밀번호는 원칙적으로 이용자만이 사용하도록 되어 있습니다. 회사는 이용자의 개인적인 부주의로 ID, 비밀번호, 주민등록번호 등 개인정보가 유출되어 발생한 문제와 기본적인 인터넷의 위험성 때문에 일어나는 일들에 대해 책임을 지지 않습니다. 비밀번호에 대한 보안 의식을 가지고 비밀번호를 자주 변경하며 공용PC에서의 로그인시 개인정보가 유출되지 않도록 각별한 주의를 기울여 주시기 바랍니다.
 
 
8. 이용자 및 법정대리인의 권리와 그 행사방법
회원 및 법정 대리인은 언제든지 등록되어 있는 자신 혹은 당해 만 14세 미만 회원의 개인정보를 조회하거나 수정할 수 있으며 가입 해지를 요청할 수도 있습니다. 회원 혹은 만 14세 미만 회원의 개인정보 조회/수정을 위해서는 ‘개인정보변경’(또는 '회원정보수정' 등)을 가입 해지(동의철회)를 위해서는 "회원탈퇴"를 클릭하여 본인 확인 절차를 거치신 후 직접 열람, 정정 또는 탈퇴가 가능하며, 또는 관리자에게 서면, 전화 또는 이메일로 연락하시면 지체 없이 조치하겠습니다. 회원 및 법정대리인이 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체 없이 통지하여 정정이 이루어지도록 하겠습니다. 회사는 회원 혹은 법정 대리인의 요청에 의해 해지 또는 삭제된 개인정보는 "회사가 수집하는 개인정보의 보유 및 이용기간"에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.

9. 개인정보보호책임자 및 상담ㆍ신고
회사는 회원의 의견을 소중하게 생각합니다.
 
개인정보보호책임자 : 김창민 실장
개인정보보호 담당부서 : 경영지원실
전화번호 : 02-566-5312
이메일 : withjuno@naver.com
개인정보침해에 관한 상담이 필요한 경우에는 아래 기관에 문의 가능합니다.
 
*[개인정보침해신고센타] 국번없이 118 / http://privacy.kisa.or.kr/kor/main.jsp
*[대검찰청 사이버수사과] 국번없이 1301 / http://www.spo.go.kr)
*[경찰청 사이버안전국] 국번없이 182 / http://cyberbureau.police.go.kr
*[개인정보분쟁조정위원회] 1833-6972 / http://cyberbureau.police.go.kr

10. 부칙
이 개인정보처리방침은 2021년 12월 10일부터 시행됩니다.`}
            </LightText>
        </Container>
    );
};

export default Privacy;
